{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|pad|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<|endoftext|>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "<|pad|>": 1,
      "!": 2,
      "\"": 3,
      "#": 4,
      "$": 5,
      "%": 6,
      "&": 7,
      "'": 8,
      "(": 9,
      ")": 10,
      "*": 11,
      "+": 12,
      ",": 13,
      "-": 14,
      ".": 15,
      "/": 16,
      "0": 17,
      "1": 18,
      "2": 19,
      "3": 20,
      "4": 21,
      "5": 22,
      "6": 23,
      "7": 24,
      "8": 25,
      "9": 26,
      ":": 27,
      ";": 28,
      "<": 29,
      "=": 30,
      ">": 31,
      "?": 32,
      "@": 33,
      "A": 34,
      "B": 35,
      "C": 36,
      "D": 37,
      "E": 38,
      "F": 39,
      "G": 40,
      "H": 41,
      "I": 42,
      "J": 43,
      "K": 44,
      "L": 45,
      "M": 46,
      "N": 47,
      "O": 48,
      "P": 49,
      "Q": 50,
      "R": 51,
      "S": 52,
      "T": 53,
      "U": 54,
      "V": 55,
      "W": 56,
      "X": 57,
      "Y": 58,
      "Z": 59,
      "[": 60,
      "\\": 61,
      "]": 62,
      "^": 63,
      "_": 64,
      "`": 65,
      "a": 66,
      "b": 67,
      "c": 68,
      "d": 69,
      "e": 70,
      "f": 71,
      "g": 72,
      "h": 73,
      "i": 74,
      "j": 75,
      "k": 76,
      "l": 77,
      "m": 78,
      "n": 79,
      "o": 80,
      "p": 81,
      "q": 82,
      "r": 83,
      "s": 84,
      "t": 85,
      "u": 86,
      "v": 87,
      "w": 88,
      "x": 89,
      "y": 90,
      "z": 91,
      "{": 92,
      "|": 93,
      "}": 94,
      "~": 95,
      "¡": 96,
      "¢": 97,
      "£": 98,
      "¤": 99,
      "¥": 100,
      "¦": 101,
      "§": 102,
      "¨": 103,
      "©": 104,
      "ª": 105,
      "«": 106,
      "¬": 107,
      "®": 108,
      "¯": 109,
      "°": 110,
      "±": 111,
      "²": 112,
      "³": 113,
      "´": 114,
      "µ": 115,
      "¶": 116,
      "·": 117,
      "¸": 118,
      "¹": 119,
      "º": 120,
      "»": 121,
      "¼": 122,
      "½": 123,
      "¾": 124,
      "¿": 125,
      "À": 126,
      "Á": 127,
      "Â": 128,
      "Ã": 129,
      "Ä": 130,
      "Å": 131,
      "Æ": 132,
      "Ç": 133,
      "È": 134,
      "É": 135,
      "Ê": 136,
      "Ë": 137,
      "Ì": 138,
      "Í": 139,
      "Î": 140,
      "Ï": 141,
      "Ð": 142,
      "Ñ": 143,
      "Ò": 144,
      "Ó": 145,
      "Ô": 146,
      "Õ": 147,
      "Ö": 148,
      "×": 149,
      "Ø": 150,
      "Ù": 151,
      "Ú": 152,
      "Û": 153,
      "Ü": 154,
      "Ý": 155,
      "Þ": 156,
      "ß": 157,
      "à": 158,
      "á": 159,
      "â": 160,
      "ã": 161,
      "ä": 162,
      "å": 163,
      "æ": 164,
      "ç": 165,
      "è": 166,
      "é": 167,
      "ê": 168,
      "ë": 169,
      "ì": 170,
      "í": 171,
      "î": 172,
      "ï": 173,
      "ð": 174,
      "ñ": 175,
      "ò": 176,
      "ó": 177,
      "ô": 178,
      "õ": 179,
      "ö": 180,
      "÷": 181,
      "ø": 182,
      "ù": 183,
      "ú": 184,
      "û": 185,
      "ü": 186,
      "ý": 187,
      "þ": 188,
      "ÿ": 189,
      "Ā": 190,
      "ā": 191,
      "Ă": 192,
      "ă": 193,
      "Ą": 194,
      "ą": 195,
      "Ć": 196,
      "ć": 197,
      "Ĉ": 198,
      "ĉ": 199,
      "Ċ": 200,
      "ċ": 201,
      "Č": 202,
      "č": 203,
      "Ď": 204,
      "ď": 205,
      "Đ": 206,
      "đ": 207,
      "Ē": 208,
      "ē": 209,
      "Ĕ": 210,
      "ĕ": 211,
      "Ė": 212,
      "ė": 213,
      "Ę": 214,
      "ę": 215,
      "Ě": 216,
      "ě": 217,
      "Ĝ": 218,
      "ĝ": 219,
      "Ğ": 220,
      "ğ": 221,
      "Ġ": 222,
      "ġ": 223,
      "Ģ": 224,
      "ģ": 225,
      "Ĥ": 226,
      "ĥ": 227,
      "Ħ": 228,
      "ħ": 229,
      "Ĩ": 230,
      "ĩ": 231,
      "Ī": 232,
      "ī": 233,
      "Ĭ": 234,
      "ĭ": 235,
      "Į": 236,
      "į": 237,
      "İ": 238,
      "ı": 239,
      "Ĳ": 240,
      "ĳ": 241,
      "Ĵ": 242,
      "ĵ": 243,
      "Ķ": 244,
      "ķ": 245,
      "ĸ": 246,
      "Ĺ": 247,
      "ĺ": 248,
      "Ļ": 249,
      "ļ": 250,
      "Ľ": 251,
      "ľ": 252,
      "Ŀ": 253,
      "ŀ": 254,
      "Ł": 255,
      "ł": 256,
      "Ń": 257,
      "ĠĠ": 258,
      "ĠĠĠĠ": 259,
      "čĊ": 260,
      "ĠĠĠ": 261,
      "ĠĠĠĠĠĠĠ": 262,
      "in": 263,
      "on": 264,
      "se": 265,
      "at": 266,
      "or": 267,
      "es": 268,
      "en": 269,
      "er": 270,
      "Ġt": 271,
      "ĠĠĠĠĠĠĠĠĠĠĠ": 272,
      "Ġ=": 273,
      "de": 274,
      "al": 275,
      "ar": 276,
      "ut": 277,
      "ion": 278,
      "st": 279,
      "re": 280,
      "an": 281,
      "he": 282,
      "Ġi": 283,
      "as": 284,
      "lf": 285,
      "ed": 286,
      "self": 287,
      "it": 288,
      "Ġ\"": 289,
      "ro": 290,
      "Ġc": 291,
      "ing": 292,
      "pe": 293,
      "Ġn": 294,
      "Ġp": 295,
      "am": 296,
      "ig": 297,
      "Ġf": 298,
      "ct": 299,
      "Ġin": 300,
      "id": 301,
      "ch": 302,
      "le": 303,
      "Ġm": 304,
      "put": 305,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 306,
      "Ġself": 307,
      "Ġs": 308,
      "iz": 309,
      "Ġo": 310,
      "Ġthe": 311,
      "est": 312,
      "ge": 313,
      "im": 314,
      "Ġd": 315,
      "lo": 316,
      "ent": 317,
      "\",": 318,
      "ra": 319,
      "):": 320,
      "Ġe": 321,
      "co": 322,
      "--": 323,
      "ce": 324,
      "Ġto": 325,
      "ode": 326,
      "Ġw": 327,
      "ur": 328,
      "ul": 329,
      "Ġ(": 330,
      "Ġde": 331,
      "la": 332,
      "Ġb": 333,
      "onf": 334,
      "um": 335,
      "onfig": 336,
      "odel": 337,
      "one": 338,
      "ize": 339,
      "Ġa": 340,
      "Ġre": 341,
      "and": 342,
      "Ġ1": 343,
      "qu": 344,
      "Ġ#": 345,
      "ame": 346,
      "att": 347,
      "ser": 348,
      "Ġis": 349,
      "pt": 350,
      "val": 351,
      "ate": 352,
      "ic": 353,
      "is": 354,
      "res": 355,
      "None": 356,
      "ad": 357,
      "ue": 358,
      "to": 359,
      "ype": 360,
      "Ġ[": 361,
      "un": 362,
      "ult": 363,
      "el": 364,
      "ken": 365,
      "Ġdef": 366,
      "ot": 367,
      "Ġif": 368,
      "sor": 369,
      "Ġof": 370,
      "mp": 371,
      "orch": 372,
      "age": 373,
      "th": 374,
      "],": 375,
      "den": 376,
      "orm": 377,
      "ation": 378,
      "ĠNone": 379,
      "utput": 380,
      "size": 381,
      "ĠT": 382,
      "()": 383,
      "\")": 384,
      "idden": 385,
      "type": 386,
      "hidden": 387,
      "di": 388,
      "li": 389,
      "ort": 390,
      "der": 391,
      "ol": 392,
      "rom": 393,
      "Ġfor": 394,
      "ke": 395,
      "Ġ)": 396,
      "tur": 397,
      "Ġ`": 398,
      "ention": 399,
      "turn": 400,
      "sert": 401,
      "ass": 402,
      "\"\"": 403,
      "po": 404,
      "ex": 405,
      "ht": 406,
      "Ġ2": 407,
      "assert": 408,
      "ask": 409,
      "str": 410,
      "test": 411,
      "ata": 412,
      "attention": 413,
      "00": 414,
      "up": 415,
      "Ġ*": 416,
      "em": 417,
      "ith": 418,
      "Ġex": 419,
      "ers": 420,
      "il": 421,
      "\":": 422,
      "int": 423,
      "ck": 424,
      "dex": 425,
      "atch": 426,
      "Ġ0": 427,
      "config": 428,
      "ional": 429,
      "Ġ-": 430,
      "__": 431,
      "----": 432,
      "Ġreturn": 433,
      "ates": 434,
      "ight": 435,
      "ha": 436,
      "lass": 437,
      "py": 438,
      "od": 439,
      "Ġnot": 440,
      "ensor": 441,
      "Ġand": 442,
      "(\"": 443,
      "ding": 444,
      "arg": 445,
      "len": 446,
      "ces": 447,
      "pro": 448,
      "states": 449,
      "coder": 450,
      "ran": 451,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 452,
      "token": 453,
      "rue": 454,
      "ptional": 455,
      "par": 456,
      "bed": 457,
      "input": 458,
      "lay": 459,
      "),": 460,
      "mask": 461,
      "Ġmodel": 462,
      "pl": 463,
      "vi": 464,
      "ray": 465,
      "cted": 466,
      "Ġimp": 467,
      "ext": 468,
      "key": 469,
      "torch": 470,
      "model": 471,
      "che": 472,
      "get": 473,
      "..": 474,
      "Ġth": 475,
      "lab": 476,
      "Ġtest": 477,
      "ma": 478,
      "Ġinput": 479,
      "from": 480,
      "ĠA": 481,
      "ues": 482,
      "Ġse": 483,
      "=\"": 484,
      "ids": 485,
      "ĠS": 486,
      "result": 487,
      "ĠI": 488,
      "form": 489,
      "Ġwith": 490,
      ">>": 491,
      "all": 492,
      "values": 493,
      "ĠO": 494,
      "ab": 495,
      "Ġconfig": 496,
      "pre": 497,
      "\"]": 498,
      "pected": 499,
      "use": 500,
      "Ġimport": 501,
      "array": 502,
      "Ġor": 503,
      "hape": 504,
      "if": 505,
      "ver": 506,
      "Ġbe": 507,
      "args": 508,
      "om": 509,
      "els": 510,
      "[\"": 511,
      "ĠC": 512,
      "rain": 513,
      "dict": 514,
      "embed": 515,
      "ies": 516,
      "mage": 517,
      "Ġ\"\"\"": 518,
      "ve": 519,
      "Ġr": 520,
      "eat": 521,
      "output": 522,
      "os": 523,
      "Ġnp": 524,
      "class": 525,
      "ix": 526,
      "num": 527,
      "alse": 528,
      "Ġtorch": 529,
      "Ġexpected": 530,
      "ure": 531,
      "Ġ{": 532,
      "Ġg": 533,
      "loat": 534,
      "False": 535,
      "Ġ==": 536,
      "Ġ:": 537,
      "con": 538,
      "qual": 539,
      "Ġoutput": 540,
      "ter": 541,
      "Ġassert": 542,
      "Tensor": 543,
      ").": 544,
      "Ġnum": 545,
      "==": 546,
      "ault": 547,
      "Ġ3": 548,
      "Ġma": 549,
      "eight": 550,
      "Ġlo": 551,
      "True": 552,
      "rame": 553,
      "rans": 554,
      "ine": 555,
      "ition": 556,
      "ĠĠĠĠĠĠĠĠ": 557,
      "Ġen": 558,
      "ĠD": 559,
      "ĠL": 560,
      "us": 561,
      "Ġ_": 562,
      "et": 563,
      "izer": 564,
      "ror": 565,
      "ast": 566,
      "Ġy": 567,
      "name": 568,
      "ime": 569,
      "Ġtoken": 570,
      "ache": 571,
      "index": 572,
      "01": 573,
      "bo": 574,
      "Ġuse": 575,
      "Ġhidden": 576,
      "value": 577,
      "ise": 578,
      "ath": 579,
      "def": 580,
      "head": 581,
      "gth": 582,
      "list": 583,
      "layer": 584,
      "ore": 585,
      "Ġimage": 586,
      "Ġ+": 587,
      "ss": 588,
      "ĠP": 589,
      "Ġcon": 590,
      "ect": 591,
      "ĠOptional": 592,
      "length": 593,
      "set": 594,
      "image": 595,
      "Ġel": 596,
      "Ġ(`": 597,
      "Ġresult": 598,
      "Ġelse": 599,
      "oc": 600,
      "Ġh": 601,
      "port": 602,
      "ta": 603,
      "ence": 604,
      "Ġst": 605,
      "))": 606,
      "`,": 607,
      "ple": 608,
      "ile": 609,
      "._": 610,
      "ase": 611,
      "pos": 612,
      "Ġdefault": 613,
      "wargs": 614,
      "ial": 615,
      "Ġl": 616,
      "Ġdtype": 617,
      "cal": 618,
      "ense": 619,
      "per": 620,
      "Ġ'": 621,
      "cessor": 622,
      "([": 623,
      "ransform": 624,
      "data": 625,
      "dtype": 626,
      "ĠThe": 627,
      "are": 628,
      "bj": 629,
      "weight": 630,
      "ly": 631,
      "shape": 632,
      "Ġas": 633,
      "labels": 634,
      "ps": 635,
      "Ġattention": 636,
      "init": 637,
      "Ġco": 638,
      "icense": 639,
      "Ġfrom": 640,
      "ance": 641,
      "Ġpro": 642,
      "kwargs": 643,
      "arn": 644,
      "ðŁ": 645,
      "feat": 646,
      "vice": 647,
      "ampl": 648,
      "dim": 649,
      "ðŁļ": 650,
      "ðŁļ¨": 651,
      "Ġv": 652,
      "Ġon": 653,
      "ðŁļ¨ðŁļ¨": 654,
      "Ġdf": 655,
      "Er": 656,
      "ction": 657,
      "])": 658,
      "train": 659,
      "ew": 660,
      "ĠR": 661,
      "Error": 662,
      "In": 663,
      "ener": 664,
      "tr": 665,
      "ision": 666,
      "Ġun": 667,
      ">>>": 668,
      "raise": 669,
      "equal": 670,
      "optional": 671,
      "inputs": 672,
      "Model": 673,
      "Ġ>>>": 674,
      "ow": 675,
      "Ġ..": 676,
      "Ġpar": 677,
      "Ġstr": 678,
      "ann": 679,
      "Ġdi": 680,
      "text": 681,
      "ures": 682,
      "dings": 683,
      "Ġwh": 684,
      "Ġpre": 685,
      "ded": 686,
      "--------": 687,
      "##": 688,
      "Ġdata": 689,
      "time": 690,
      "ag": 691,
      "ĠX": 692,
      "batch": 693,
      "its": 694,
      "ator": 695,
      "norm": 696,
      "Ġpy": 697,
      "ub": 698,
      "ap": 699,
      "sion": 700,
      "pec": 701,
      "Ġthat": 702,
      "Ġ@": 703,
      "col": 704,
      "ĠG": 705,
      "ĠB": 706,
      "ack": 707,
      "ip": 708,
      "ment": 709,
      "ĠM": 710,
      "Ġ->": 711,
      "ule": 712,
      "ns": 713,
      "np": 714,
      "Ġ4": 715,
      "ĠW": 716,
      "ill": 717,
      "ib": 718,
      "log": 719,
      "Ġint": 720,
      "ff": 721,
      "path": 722,
      "ĠLicense": 723,
      "position": 724,
      "ard": 725,
      "attn": 726,
      "ĠIn": 727,
      "ind": 728,
      "ctor": 729,
      "ir": 730,
      "ample": 731,
      "odule": 732,
      "Ġan": 733,
      "idx": 734,
      "Ġare": 735,
      "ĠN": 736,
      "Ġindex": 737,
      "eries": 738,
      "andom": 739,
      "Ġpytest": 740,
      "Ġtm": 741,
      "ant": 742,
      "Ġ...": 743,
      "roup": 744,
      "amples": 745,
      "float": 746,
      "quence": 747,
      "layers": 748,
      "Ġbo": 749,
      "64": 750,
      "state": 751,
      "Ġx": 752,
      "ist": 753,
      "max": 754,
      "Frame": 755,
      "ames": 756,
      "heck": 757,
      "tokens": 758,
      "cl": 759,
      "sc": 760,
      "Ġ[\"": 761,
      "pytest": 762,
      "end": 763,
      "range": 764,
      "cess": 765,
      "ust": 766,
      "bject": 767,
      "ataFrame": 768,
      "able": 769,
      "\"\"\"": 770,
      "ay": 771,
      "ĠE": 772,
      "Ġkey": 773,
      "16": 774,
      "====": 775,
      "Ġdo": 776,
      "Config": 777,
      "me": 778,
      "Ġ**": 779,
      "ary": 780,
      "art": 781,
      "//": 782,
      "ĠFalse": 783,
      "ĠV": 784,
      "stance": 785,
      "import": 786,
      "Ġby": 787,
      "device": 788,
      "Ġres": 789,
      "For": 790,
      "eg": 791,
      "out": 792,
      "Ġmax": 793,
      "ĠTrue": 794,
      "Ġinputs": 795,
      "Ġcol": 796,
      "embeddings": 797,
      "ark": 798,
      "\"),": 799,
      "features": 800,
      "fa": 801,
      "\"],": 802,
      "ber": 803,
      "heads": 804,
      "ho": 805,
      "qui": 806,
      "ft": 807,
      "ee": 808,
      "low": 809,
      "*,": 810,
      "Ġ5": 811,
      "Ġlist": 812,
      "Ġpos": 813,
      "gg": 814,
      "',": 815,
      "ds": 816,
      "thod": 817,
      "Ġthis": 818,
      "Ġdefaults": 819,
      "Ġsup": 820,
      "[:": 821,
      "ong": 822,
      "Ġmask": 823,
      "ive": 824,
      "Ġal": 825,
      "Ġget": 826,
      "ulti": 827,
      "tensor": 828,
      "point": 829,
      "ĠU": 830,
      "ateg": 831,
      "():": 832,
      "dro": 833,
      "uto": 834,
      "Ġpad": 835,
      "ocab": 836,
      "Ġit": 837,
      "pout": 838,
      "parame": 839,
      "inal": 840,
      "ĠDataFrame": 841,
      "encoder": 842,
      "uple": 843,
      "__(": 844,
      "attr": 845,
      "decoder": 846,
      "Ġset": 847,
      "fer": 848,
      "cept": 849,
      "Ġnn": 850,
      "ity": 851,
      "ias": 852,
      "atetime": 853,
      "attentions": 854,
      "02": 855,
      "cache": 856,
      "ated": 857,
      "ices": 858,
      "Ġraise": 859,
      "Ġk": 860,
      "Ġvalue": 861,
      "ou": 862,
      "Ġshape": 863,
      "ils": 864,
      "mark": 865,
      "`):": 866,
      "com": 867,
      "embeds": 868,
      "Ġall": 869,
      "asse": 870,
      "ern": 871,
      "file": 872,
      "outputs": 873,
      "Ġ(\"": 874,
      "frame": 875,
      "]]": 876,
      "alue": 877,
      ".__": 878,
      "ific": 879,
      "lock": 880,
      "Ġme": 881,
      "Ġle": 882,
      "ther": 883,
      "Ġcheck": 884,
      "for": 885,
      "Ġ100": 886,
      "Ġwe": 887,
      "`.": 888,
      "pad": 889,
      "proj": 890,
      "arget": 891,
      "alueError": 892,
      "line": 893,
      "row": 894,
      "fun": 895,
      "Ġvalues": 896,
      "mbed": 897,
      "kip": 898,
      "arning": 899,
      "vide": 900,
      "idth": 901,
      "Ġ__": 902,
      "processor": 903,
      "ward": 904,
      "fo": 905,
      "bool": 906,
      "},": 907,
      "ON": 908,
      "ibut": 909,
      "Ġfeat": 910,
      "uld": 911,
      "Index": 912,
      "cale": 913,
      "Test": 914,
      "parse": 915,
      "instance": 916,
      "valid": 917,
      "Ġper": 918,
      "string": 919,
      "iv": 920,
      "Ġname": 921,
      "Ġclass": 922,
      "Ġlayer": 923,
      "umns": 924,
      "ransformers": 925,
      "].": 926,
      "check": 927,
      "nan": 928,
      "fit": 929,
      "ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨": 930,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 931,
      "IN": 932,
      "ifi": 933,
      "andas": 934,
      "ĠSeries": 935,
      "sg": 936,
      "act": 937,
      "Ġwill": 938,
      "vert": 939,
      "Equal": 940,
      "ide": 941,
      "ess": 942,
      "ersion": 943,
      "Ġencoder": 944,
      "imator": 945,
      "label": 946,
      "Ġ<": 947,
      "utils": 948,
      "Ġpd": 949,
      "ere": 950,
      "yp": 951,
      "samples": 952,
      "ategor": 953,
      "comp": 954,
      "tain": 955,
      "Ġspec": 956,
      "code": 957,
      "pa": 958,
      "mo": 959,
      "201": 960,
      "Ġ``": 961,
      "ĠRe": 962,
      "av": 963,
      "ĠF": 964,
      "Ġmatch": 965,
      "Ġsize": 966,
      "Ġused": 967,
      "logits": 968,
      "trained": 969,
      "Ġisinstance": 970,
      "ations": 971,
      "req": 972,
      "xis": 973,
      "quire": 974,
      "Ġtokenizer": 975,
      "ixel": 976,
      "process": 977,
      "lable": 978,
      "Ġdim": 979,
      "ents": 980,
      "ension": 981,
      "htt": 982,
      "ep": 983,
      "10": 984,
      "Ġch": 985,
      "height": 986,
      "ach": 987,
      "with": 988,
      "ages": 989,
      "ĠH": 990,
      "his": 991,
      "dropout": 992,
      "Ġoutputs": 993,
      "Ġqu": 994,
      "####": 995,
      "inter": 996,
      "Ġtext": 997,
      "Ġlen": 998,
      "rit": 999,
      "eneration": 1000,
      "Ġposition": 1001,
      "df": 1002,
      "ang": 1003,
      "Ġbool": 1004,
      "ĠIf": 1005,
      "Ġbatch": 1006,
      "pp": 1007,
      "series": 1008,
      "ters": 1009,
      "://": 1010,
      "cor": 1011,
      "uration": 1012,
      "annels": 1013,
      "Ġcan": 1014,
      "patch": 1015,
      "last": 1016,
      "Float": 1017,
      "prob": 1018,
      "hould": 1019,
      "32": 1020,
      "group": 1021,
      "Ġat": 1022,
      "Ġsequence": 1023,
      "TI": 1024,
      "fix": 1025,
      "Ġcomp": 1026,
      "gging": 1027,
      "Ġhas": 1028,
      "**": 1029,
      "12": 1030,
      "vision": 1031,
      "tester": 1032,
      "param": 1033,
      "estimator": 1034,
      "Pro": 1035,
      "Ġunder": 1036,
      "ts": 1037,
      "Ġtype": 1038,
      "Ġad": 1039,
      "pretrained": 1040,
      "random": 1041,
      "Ġ{\"": 1042,
      "lif": 1043,
      "Ġnew": 1044,
      "udi": 1045,
      "names": 1046,
      "xes": 1047,
      "bias": 1048,
      "min": 1049,
      "Ġ|": 1050,
      "ign": 1051,
      "Ġlabels": 1052,
      "assertEqual": 1053,
      "learn": 1054,
      "parametr": 1055,
      "FloatTensor": 1056,
      "Ġdecoder": 1057,
      "ery": 1058,
      "iod": 1059,
      "udio": 1060,
      "Ġwhen": 1061,
      "Ġcom": 1062,
      "dir": 1063,
      "Ġexp": 1064,
      "ized": 1065,
      "parametrize": 1066,
      "Ġembed": 1067,
      "Ġloss": 1068,
      "Ġinit": 1069,
      "ual": 1070,
      "Ġshould": 1071,
      "Ġelif": 1072,
      "To": 1073,
      "error": 1074,
      "Ġcache": 1075,
      "loc": 1076,
      "video": 1077,
      "Ġarray": 1078,
      "Ġsuper": 1079,
      "Ġ/": 1080,
      "Ġ1001": 1081,
      "aus": 1082,
      "Ġid": 1083,
      "Ġfun": 1084,
      "pend": 1085,
      "irst": 1086,
      "Train": 1087,
      "loss": 1088,
      "ac": 1089,
      "ai": 1090,
      "Ġ216": 1091,
      "Ġfloat": 1092,
      "etr": 1093,
      "channels": 1094,
      "vel": 1095,
      "[:,": 1096,
      "Ġobject": 1097,
      "op": 1098,
      "pr": 1099,
      "seq": 1100,
      "format": 1101,
      "weights": 1102,
      "lace": 1103,
      "Ġ>": 1104,
      "ical": 1105,
      "plit": 1106,
      "tokenizer": 1107,
      "vocab": 1108,
      "doc": 1109,
      "item": 1110,
      "Ġeach": 1111,
      "emp": 1112,
      "Ġap": 1113,
      "edi": 1114,
      "Pre": 1115,
      "gs": 1116,
      "pare": 1117,
      "ross": 1118,
      "ĠValueError": 1119,
      "images": 1120,
      "AS": 1121,
      "Ġdevice": 1122,
      "spec": 1123,
      "Ġso": 1124,
      "ll": 1125,
      "Ġweight": 1126,
      "Ġmethod": 1127,
      "na": 1128,
      "Ġfile": 1129,
      "mean": 1130,
      "raises": 1131,
      "LM": 1132,
      "Ġlog": 1133,
      "no": 1134,
      "Ġ7": 1135,
      "start": 1136,
      "ng": 1137,
      "conv": 1138,
      "module": 1139,
      "so": 1140,
      "asses": 1141,
      "lib": 1142,
      "jo": 1143,
      "quest": 1144,
      "Ġ--------": 1145,
      "Ġ6": 1146,
      "Ġinter": 1147,
      "eps": 1148,
      "ĠThis": 1149,
      "ification": 1150,
      "coding": 1151,
      "\"])": 1152,
      "sh": 1153,
      "ges": 1154,
      "zer": 1155,
      "do": 1156,
      "block": 1157,
      "ausal": 1158,
      "ES": 1159,
      "klearn": 1160,
      "Ġpast": 1161,
      "ord": 1162,
      "ions": 1163,
      "Ġro": 1164,
      "Token": 1165,
      "transform": 1166,
      "{\"": 1167,
      "Ġtrain": 1168,
      "normal": 1169,
      "Trained": 1170,
      "ifier": 1171,
      "ĠUn": 1172,
      "========": 1173,
      "Ġmay": 1174,
      "ĠGH": 1175,
      "score": 1176,
      "Ġha": 1177,
      "Ġpass": 1178,
      "Output": 1179,
      "place": 1180,
      "Ġattn": 1181,
      "append": 1182,
      "Ġtransformers": 1183,
      "like": 1184,
      "iss": 1185,
      "stribut": 1186,
      "medi": 1187,
      "Ġpandas": 1188,
      "ml": 1189,
      "lose": 1190,
      "ailable": 1191,
      "sum": 1192,
      "Processor": 1193,
      "inear": 1194,
      "nt": 1195,
      "feature": 1196,
      "date": 1197,
      "arr": 1198,
      "Image": 1199,
      "ization": 1200,
      "Ġtr": 1201,
      "Ġpo": 1202,
      "Class": 1203,
      "ok": 1204,
      "skip": 1205,
      "000": 1206,
      "ĠReturn": 1207,
      "del": 1208,
      "ply": 1209,
      "ernel": 1210,
      "nd": 1211,
      "predict": 1212,
      "lot": 1213,
      "mentation": 1214,
      "Ġ10": 1215,
      "ĠEx": 1216,
      "object": 1217,
      "ypes": 1218,
      "cat": 1219,
      "ange": 1220,
      "Ġcl": 1221,
      "Ar": 1222,
      "gra": 1223,
      "Ġus": 1224,
      "Ġpadding": 1225,
      "*):": 1226,
      "Ġtarget": 1227,
      "mon": 1228,
      "rid": 1229,
      "((": 1230,
      "new": 1231,
      "iginal": 1232,
      "keys": 1233,
      "Ġ]": 1234,
      "().__": 1235,
      "unk": 1236,
      "Ġcopy": 1237,
      "Ġ8": 1238,
      "right": 1239,
      "Ġrandom": 1240,
      "by": 1241,
      "[-": 1242,
      "Ġout": 1243,
      "Ġforward": 1244,
      "Ġdict": 1245,
      "read": 1246,
      "ument": 1247,
      "Ġnumber": 1248,
      "ich": 1249,
      "auto": 1250,
      "EN": 1251,
      "ĠAr": 1252,
      "Ġtokens": 1253,
      "Ġtime": 1254,
      "amp": 1255,
      "Ġarg": 1256,
      "ugging": 1257,
      "ari": 1258,
      "amb": 1259,
      "und": 1260,
      "Ġhave": 1261,
      "mediate": 1262,
      "Ġne": 1263,
      "Ġrange": 1264,
      "Ġno": 1265,
      "Ġrequire": 1266,
      "Long": 1267,
      "ef": 1268,
      "msg": 1269,
      "Ġfeature": 1270,
      "Ġyou": 1271,
      "tra": 1272,
      "Ġ):": 1273,
      "Ġ`(": 1274,
      "ative": 1275,
      "Ġdistribut": 1276,
      "tuple": 1277,
      "itional": 1278,
      "ĠSee": 1279,
      "nn": 1280,
      "Ġhtt": 1281,
      "add": 1282,
      "stru": 1283,
      "etric": 1284,
      "(),": 1285,
      "back": 1286,
      "mages": 1287,
      "Ġcolumns": 1288,
      "Ġ.": 1289,
      "imest": 1290,
      "LongTensor": 1291,
      "``": 1292,
      "iter": 1293,
      "ull": 1294,
      "load": 1295,
      "Ġprocessor": 1296,
      "ameters": 1297,
      "params": 1298,
      "Ġform": 1299,
      "Ġright": 1300,
      "ĠK": 1301,
      "Ġsh": 1302,
      "Ġonly": 1303,
      "oth": 1304,
      "ayer": 1305,
      "umn": 1306,
      "}.": 1307,
      "reate": 1308,
      "processing": 1309,
      "Con": 1310,
      "tt": 1311,
      "Ġconfiguration": 1312,
      "99": 1313,
      "ww": 1314,
      "Ġtuple": 1315,
      "Ġimages": 1316,
      "available": 1317,
      "ree": 1318,
      "delta": 1319,
      "AR": 1320,
      "width": 1321,
      "Ġ}": 1322,
      "ression": 1323,
      "Ġ!": 1324,
      "ipe": 1325,
      "angu": 1326,
      "method": 1327,
      "PreTrained": 1328,
      "ne": 1329,
      "reg": 1330,
      "PE": 1331,
      "Ġfunction": 1332,
      "face": 1333,
      "AN": 1334,
      "Ġdatetime": 1335,
      "own": 1336,
      "Ġmin": 1337,
      "Ġ],": 1338,
      "Ġ!=": 1339,
      "Ġwhich": 1340,
      "gener": 1341,
      "(-": 1342,
      "Ġexcept": 1343,
      "atr": 1344,
      "Ġwidth": 1345,
      "})": 1346,
      "anguage": 1347,
      "default": 1348,
      "tensors": 1349,
      "Ġind": 1350,
      "Module": 1351,
      "extra": 1352,
      "ĠY": 1353,
      "Ġ[`": 1354,
      "]:": 1355,
      "da": 1356,
      "std": 1357,
      "Ġ%": 1358,
      "\"):": 1359,
      "unit": 1360,
      "past": 1361,
      "expected": 1362,
      "Layer": 1363,
      "scor": 1364,
      "indow": 1365,
      "du": 1366,
      "ie": 1367,
      "Ġusing": 1368,
      "igh": 1369,
      "lice": 1370,
      "map": 1371,
      "return": 1372,
      "pect": 1373,
      "Ġidx": 1374,
      ":`": 1375,
      "Ġother": 1376,
      "ave": 1377,
      "lm": 1378,
      "Ġdistributed": 1379,
      "info": 1380,
      "ally": 1381,
      "func": 1382,
      "LI": 1383,
      "Ġac": 1384,
      "squ": 1385,
      "io": 1386,
      "Ġadd": 1387,
      "Ġpixel": 1388,
      "indices": 1389,
      "lement": 1390,
      "Ġtensor": 1391,
      "Ġgroup": 1392,
      "classes": 1393,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1394,
      "Ġser": 1395,
      "Ġone": 1396,
      "TION": 1397,
      "ER": 1398,
      "olut": 1399,
      "=[": 1400,
      "split": 1401,
      "Tokenizer": 1402,
      "Ġpatch": 1403,
      "Ġaxis": 1404,
      "lob": 1405,
      "hether": 1406,
      "ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨": 1407,
      "annel": 1408,
      "bone": 1409,
      "Ġsupport": 1410,
      "special": 1411,
      "sub": 1412,
      "annot": 1413,
      "rompt": 1414,
      "=[\"": 1415,
      "rop": 1416,
      "ategorical": 1417,
      "old": 1418,
      "gn": 1419,
      "exp": 1420,
      "bin": 1421,
      "Ġstring": 1422,
      "Ġsklearn": 1423,
      "imestamp": 1424,
      "freq": 1425,
      "factor": 1426,
      "over": 1427,
      "ory": 1428,
      "trans": 1429,
      "ines": 1430,
      "ttention": 1431,
      "Ġlogits": 1432,
      "Ġ),": 1433,
      "Ġcomput": 1434,
      "dataset": 1435,
      "arch": 1436,
      "ĠReturns": 1437,
      "base": 1438,
      "types": 1439,
      "'s": 1440,
      "sample": 1441,
      "view": 1442,
      "([\"": 1443,
      "lip": 1444,
      "sequence": 1445,
      "ors": 1446,
      "Ġcor": 1447,
      "ved": 1448,
      "ech": 1449,
      "().": 1450,
      "Ġover": 1451,
      "ze": 1452,
      "rect": 1453,
      "Ġinitial": 1454,
      "ection": 1455,
      "columns": 1456,
      "plot": 1457,
      "Ġsc": 1458,
      "Ġvocab": 1459,
      "100": 1460,
      "urr": 1461,
      "pth": 1462,
      "Ġstart": 1463,
      "close": 1464,
      "----------------": 1465,
      "sent": 1466,
      "Ġsample": 1467,
      "Ġlength": 1468,
      "obj": 1469,
      "De": 1470,
      "pping": 1471,
      "ler": 1472,
      "ipeline": 1473,
      "join": 1474,
      "uff": 1475,
      "Ġquery": 1476,
      "ca": 1477,
      "ĠIndex": 1478,
      "Array": 1479,
      "sed": 1480,
      "target": 1481,
      ".\"": 1482,
      "prepare": 1483,
      "Ġgener": 1484,
      "Ġlast": 1485,
      "numpy": 1486,
      "Ġfreq": 1487,
      "Ġpytester": 1488,
      "copy": 1489,
      "Ġsub": 1490,
      "56": 1491,
      "Ġdif": 1492,
      "ference": 1493,
      "Ġconvert": 1494,
      "Ġinst": 1495,
      "Ġseq": 1496,
      "Linear": 1497,
      "Ġnorm": 1498,
      "Ex": 1499,
      "the": 1500,
      "peech": 1501,
      "assed": 1502,
      "Ġweights": 1503,
      "Ġmake": 1504,
      "ous": 1505,
      "coun": 1506,
      "Ġoriginal": 1507,
      "thon": 1508,
      "Ġpr": 1509,
      "Ġ//": 1510,
      "TE": 1511,
      "########": 1512,
      "20": 1513,
      "Ġfeatures": 1514,
      "pixel": 1515,
      "Ġ9": 1516,
      "())": 1517,
      "izes": 1518,
      "ither": 1519,
      "Ġparser": 1520,
      "wise": 1521,
      "mod": 1522,
      "Ġmore": 1523,
      "hel": 1524,
      "UT": 1525,
      "ĠTest": 1526,
      "SE": 1527,
      "left": 1528,
      "Ġerror": 1529,
      "Ġformat": 1530,
      "Mix": 1531,
      "Ġup": 1532,
      "Ġob": 1533,
      "son": 1534,
      "ĠAuto": 1535,
      "cision": 1536,
      "coded": 1537,
      ",)": 1538,
      "dient": 1539,
      "issing": 1540,
      "modeling": 1541,
      "ĠPar": 1542,
      "fil": 1543,
      "'t": 1544,
      "Ġmodule": 1545,
      "ameter": 1546,
      "atrix": 1547,
      "({\"": 1548,
      "ndarray": 1549,
      "Type": 1550,
      "multi": 1551,
      "Ġcont": 1552,
      "Ġfa": 1553,
      "ork": 1554,
      "quen": 1555,
      "bs": 1556,
      "Ġvision": 1557,
      "eeze": 1558,
      "30": 1559,
      "15": 1560,
      "scores": 1561,
      "axis": 1562,
      "json": 1563,
      "ransformer": 1564,
      "imple": 1565,
      "Ġ12": 1566,
      "ug": 1567,
      "lect": 1568,
      "foo": 1569,
      "run": 1570,
      "off": 1571,
      "les": 1572,
      "plic": 1573,
      "wen": 1574,
      "Ġend": 1575,
      "Ġdoes": 1576,
      "Ġargs": 1577,
      "pert": 1578,
      "Se": 1579,
      "training": 1580,
      "ING": 1581,
      "Ġsame": 1582,
      "Ġembeddings": 1583,
      "cond": 1584,
      "docstring": 1585,
      "scal": 1586,
      "Ġheight": 1587,
      "keep": 1588,
      "Ġcase": 1589,
      "iel": 1590,
      "Ġ[]": 1591,
      "\"))": 1592,
      "datetime": 1593,
      "(**": 1594,
      "Norm": 1595,
      "pace": 1596,
      "ify": 1597,
      "ture": 1598,
      "raw": 1599,
      "Ġhead": 1600,
      "ash": 1601,
      "ĠCo": 1602,
      "match": 1603,
      "pty": 1604,
      "points": 1605,
      "OD": 1606,
      "emory": 1607,
      "14": 1608,
      "Ġmulti": 1609,
      "ning": 1610,
      "squeeze": 1611,
      ".\"\"\"": 1612,
      "Un": 1613,
      "Ġvalid": 1614,
      "ert": 1615,
      "Ġmust": 1616,
      "pred": 1617,
      "lobal": 1618,
      "ĠPy": 1619,
      "Ġmsg": 1620,
      "urrent": 1621,
      "Ġfirst": 1622,
      "Ġlanguage": 1623,
      "wer": 1624,
      "pen": 1625,
      "Ġrequired": 1626,
      "Ġskip": 1627,
      "ress": 1628,
      "testing": 1629,
      "ingle": 1630,
      "ĠArgs": 1631,
      "astype": 1632,
      "less": 1633,
      "Ġbut": 1634,
      "af": 1635,
      "convert": 1636,
      "200": 1637,
      "opt": 1638,
      "]],": 1639,
      "Attention": 1640,
      "En": 1641,
      "Ġestimator": 1642,
      "level": 1643,
      "ValueError": 1644,
      "pon": 1645,
      "warning": 1646,
      "ead": 1647,
      "call": 1648,
      "og": 1649,
      "ampling": 1650,
      "Ġstate": 1651,
      "Ġpath": 1652,
      "Ġeither": 1653,
      "Ġbase": 1654,
      "Ġcall": 1655,
      "\"{": 1656,
      "sp": 1657,
      "Ġpa": 1658,
      "of": 1659,
      "Ġnumpy": 1660,
      "Ġcontain": 1661,
      "audio": 1662,
      "org": 1663,
      "cont": 1664,
      "Ġpredict": 1665,
      "\").": 1666,
      "Mixin": 1667,
      "onents": 1668,
      "ched": 1669,
      "checkpoint": 1670,
      "Text": 1671,
      "cy": 1672,
      "Ġpassed": 1673,
      "ied": 1674,
      "eval": 1675,
      "function": 1676,
      "boxes": 1677,
      "ible": 1678,
      "Ġign": 1679,
      "ĠWhether": 1680,
      "TH": 1681,
      "box": 1682,
      "word": 1683,
      "Ġwrit": 1684,
      "fl": 1685,
      "ax": 1686,
      "ename": 1687,
      "pose": 1688,
      "imit": 1689,
      "scale": 1690,
      "03": 1691,
      "Ġversion": 1692,
      "`]": 1693,
      "etad": 1694,
      "etadata": 1695,
      "eam": 1696,
      "writ": 1697,
      "Ġ`\"": 1698,
      "tw": 1699,
      "MA": 1700,
      "]),": 1701,
      "ĠQ": 1702,
      "ĠĠĠĠĠ": 1703,
      "first": 1704,
      "Ġnames": 1705,
      "Ġvideo": 1706,
      "unc": 1707,
      "cent": 1708,
      "iods": 1709,
      "zeros": 1710,
      "only": 1711,
      "Ġdataset": 1712,
      "04": 1713,
      "0000": 1714,
      "IL": 1715,
      "cr": 1716,
      "arange": 1717,
      "lied": 1718,
      "05": 1719,
      "Tester": 1720,
      "Ġkwargs": 1721,
      "olution": 1722,
      "cs": 1723,
      "true": 1724,
      "11": 1725,
      "des": 1726,
      "\"].": 1727,
      "assertTrue": 1728,
      "Ġtraining": 1729,
      "sparse": 1730,
      "prefix": 1731,
      "require": 1732,
      "25": 1733,
      "my": 1734,
      "Ġload": 1735,
      "Ġ\\": 1736,
      "rope": 1737,
      "sizes": 1738,
      "Ġneed": 1739,
      "struct": 1740,
      "lean": 1741,
      "__()": 1742,
      "offset": 1743,
      "atio": 1744,
      "models": 1745,
      "Ġparam": 1746,
      "Ġfil": 1747,
      "pol": 1748,
      "DI": 1749,
      "not": 1750,
      "Ġnon": 1751,
      "gre": 1752,
      "Ġreg": 1753,
      "ys": 1754,
      ".,": 1755,
      "}\"": 1756,
      "ted": 1757,
      "Ġany": 1758,
      "generate": 1759,
      "Ġspecific": 1760,
      "linear": 1761,
      "iqu": 1762,
      "Ġleft": 1763,
      "kernel": 1764,
      "Ġscor": 1765,
      "ModelOutput": 1766,
      "query": 1767,
      "common": 1768,
      "long": 1769,
      "Ġ----": 1770,
      "yn": 1771,
      "ĠFor": 1772,
      "pha": 1773,
      "::": 1774,
      "forward": 1775,
      "TIONS": 1776,
      "ak": 1777,
      "19": 1778,
      "Ġscal": 1779,
      "Ġ+=": 1780,
      "Ġaudio": 1781,
      "OR": 1782,
      "replace": 1783,
      "Ġ----------": 1784,
      ".{": 1785,
      "version": 1786,
      "IS": 1787,
      "ays": 1788,
      "intermediate": 1789,
      "Ġq": 1790,
      "fn": 1791,
      "Ġoff": 1792,
      "ield": 1793,
      "Ġback": 1794,
      "ategories": 1795,
      "ict": 1796,
      "Ġarr": 1797,
      "24": 1798,
      "Ġrequest": 1799,
      "post": 1800,
      "embedding": 1801,
      "Series": 1802,
      "ting": 1803,
      "Ġcreate": 1804,
      "padding": 1805,
      "generation": 1806,
      "ans": 1807,
      "Ġlayers": 1808,
      "Ġobtain": 1809,
      "gine": 1810,
      "Fa": 1811,
      "Ġlabel": 1812,
      "Ġtemp": 1813,
      "Ġdiffer": 1814,
      "Ġunit": 1815,
      "uments": 1816,
      "Ġindices": 1817,
      "ĠBase": 1818,
      "Ġgetattr": 1819,
      "served": 1820,
      "tz": 1821,
      "reshape": 1822,
      "fill": 1823,
      "masks": 1824,
      "ustom": 1825,
      "zero": 1826,
      "quant": 1827,
      "With": 1828,
      "Ġ:,": 1829,
      "ĠCon": 1830,
      "Ġ[[": 1831,
      "any": 1832,
      "Ġorder": 1833,
      "ĠParameters": 1834,
      "ĠYou": 1835,
      "Vision": 1836,
      "Ġframe": 1837,
      "Dtype": 1838,
      "`:": 1839,
      "items": 1840,
      "components": 1841,
      "ĠNot": 1842,
      "=-": 1843,
      "ĠMulti": 1844,
      "ivation": 1845,
      "ware": 1846,
      "resize": 1847,
      "Ġbias": 1848,
      "Ġnormal": 1849,
      "ason": 1850,
      "book": 1851,
      "te": 1852,
      "pu": 1853,
      "Ġids": 1854,
      "Ġblock": 1855,
      "ambda": 1856,
      "window": 1857,
      "eric": 1858,
      "vari": 1859,
      "Ġobj": 1860,
      "slice": 1861,
      "Ġdimension": 1862,
      "ms": 1863,
      "Ġact": 1864,
      "Ġprint": 1865,
      "help": 1866,
      "pandas": 1867,
      "attribut": 1868,
      "resh": 1869,
      "Ġrng": 1870,
      "ager": 1871,
      "mis": 1872,
      "Ġdoc": 1873,
      "33": 1874,
      "ausalLM": 1875,
      "ĠSe": 1876,
      "patches": 1877,
      "Ġlimit": 1878,
      "ome": 1879,
      "andard": 1880,
      "bar": 1881,
      "uc": 1882,
      "ility": 1883,
      "([[": 1884,
      "Ġparameter": 1885,
      "Ġver": 1886,
      "Ġla": 1887,
      "ĠNum": 1888,
      "Ġapply": 1889,
      "ĠAN": 1890,
      "logg": 1891,
      "ropout": 1892,
      "lection": 1893,
      "ST": 1894,
      "atic": 1895,
      "PreTrainedModel": 1896,
      ")),": 1897,
      "uggingface": 1898,
      "ec": 1899,
      "tmp": 1900,
      "drop": 1901,
      "---": 1902,
      "temp": 1903,
      "transpose": 1904,
      "ified": 1905,
      "ĠWe": 1906,
      "ords": 1907,
      "user": 1908,
      "ama": 1909,
      "url": 1910,
      "encoding": 1911,
      "Encoder": 1912,
      "OUT": 1913,
      "Classifier": 1914,
      "lines": 1915,
      "Ġclf": 1916,
      "18": 1917,
      "ĠCON": 1918,
      "ny": 1919,
      "ph": 1920,
      "Ġhttps": 1921,
      "Ġsoft": 1922,
      "rel": 1923,
      "ick": 1924,
      "Ġfit": 1925,
      "Ġdis": 1926,
      "ĠAp": 1927,
      "ink": 1928,
      "Reg": 1929,
      "Ġtz": 1930,
      "metric": 1931,
      "normalize": 1932,
      "rng": 1933,
      "License": 1934,
      "apt": 1935,
      "ĠANY": 1936,
      "grad": 1937,
      "Ġax": 1938,
      "ared": 1939,
      "ĠUnion": 1940,
      "tal": 1941,
      "Ġos": 1942,
      "RAN": 1943,
      "Ġsin": 1944,
      "blocks": 1945,
      "cls": 1946,
      "ique": 1947,
      "Ġopt": 1948,
      "gr": 1949,
      "Ġwarning": 1950,
      "vector": 1951,
      "Ġpoint": 1952,
      "Ġdifferent": 1953,
      "Ġhttp": 1954,
      "essage": 1955,
      "Ġass": 1956,
      "idual": 1957,
      "clu": 1958,
      "Ġsparse": 1959,
      "Ġj": 1960,
      "Ġprob": 1961,
      "ular": 1962,
      "count": 1963,
      "stack": 1964,
      "Ġ202": 1965,
      "https": 1966,
      ".\")": 1967,
      "parameters": 1968,
      "NA": 1969,
      "Ġmo": 1970,
      "ars": 1971,
      "Ġlogging": 1972,
      "Re": 1973,
      "13": 1974,
      "imum": 1975,
      "================": 1976,
      "acken": 1977,
      "ĠPre": 1978,
      "grid": 1979,
      "sup": 1980,
      "DataFrame": 1981,
      "Ġinto": 1982,
      "rows": 1983,
      "chunk": 1984,
      "lic": 1985,
      "Warning": 1986,
      "Ġcolumn": 1987,
      "List": 1988,
      "The": 1989,
      "ithub": 1990,
      "www": 1991,
      "Face": 1992,
      "vels": 1993,
      "Ġ{}": 1994,
      "Ġdate": 1995,
      "main": 1996,
      "17": 1997,
      "cross": 1998,
      "kv": 1999,
      "dum": 2000,
      "most": 2001,
      "Ġencoding": 2002,
      "ĠPer": 2003,
      "ĠHugging": 2004,
      "_(": 2005,
      "rate": 2006,
      "Ġsort": 2007,
      "Str": 2008,
      "Ġmatrix": 2009,
      "parent": 2010,
      "eta": 2011,
      "positions": 2012,
      "Par": 2013,
      "ImageProcessor": 2014,
      "St": 2015,
      ")]": 2016,
      "fixture": 2017,
      "ĠCopy": 2018,
      "order": 2019,
      "Ġcode": 2020,
      "ditional": 2021,
      "Cache": 2022,
      "rescale": 2023,
      "backbone": 2024,
      "ĠImage": 2025,
      "quences": 2026,
      "atched": 2027,
      "late": 2028,
      "our": 2029,
      "github": 2030,
      "rames": 2031,
      "izing": 2032,
      "respon": 2033,
      "cre": 2034,
      "Ġ},": 2035,
      "Ġapplic": 2036,
      "Ġwhere": 2037,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2038,
      "rand": 2039,
      "Ġeps": 2040,
      "Ġlevel": 2041,
      "Ġgeneration": 2042,
      "Ġcurrent": 2043,
      "Classification": 2044,
      "EC": 2045,
      "ĠIS": 2046,
      "ĠOR": 2047,
      "ules": 2048,
      "Ġread": 2049,
      "ITH": 2050,
      "Ġthan": 2051,
      "non": 2052,
      "Ġav": 2053,
      "ĠVersion": 2054,
      "Decoder": 2055,
      "Mo": 2056,
      "Ġtry": 2057,
      "cessing": 2058,
      "other": 2059,
      "vided": 2060,
      "Ġapplicable": 2061,
      "ĠHuggingFace": 2062,
      "arrow": 2063,
      "utf": 2064,
      "mall": 2065,
      "Ġkernel": 2066,
      "huggingface": 2067,
      "gger": 2068,
      "initial": 2069,
      "prec": 2070,
      "Ġtw": 2071,
      "Ġ```": 2072,
      "Ġwriting": 2073,
      "greed": 2074,
      "ite": 2075,
      "wh": 2076,
      "LIC": 2077,
      "ear": 2078,
      "Ġprepare": 2079,
      "76": 2080,
      "IND": 2081,
      "Ġperiods": 2082,
      "ĠAll": 2083,
      "Ġmetric": 2084,
      "write": 2085,
      "Ġcross": 2086,
      "Ġ-------": 2087,
      "sions": 2088,
      "een": 2089,
      "imension": 2090,
      "Ġwas": 2091,
      "rc": 2092,
      "python": 2093,
      "itial": 2094,
      "older": 2095,
      "CausalLM": 2096,
      "terval": 2097,
      "ĠOF": 2098,
      "liance": 2099,
      "ĠCopyright": 2100,
      "Ġpart": 2101,
      "Ġmodels": 2102,
      "err": 2103,
      "ĠWAR": 2104,
      "Ġignore": 2105,
      "perts": 2106,
      "Ġscores": 2107,
      "Ġgiv": 2108,
      "izers": 2109,
      "apache": 2110,
      "50": 2111,
      "prompt": 2112,
      "Ġkeys": 2113,
      "ategy": 2114,
      "\");": 2115,
      "ENSE": 2116,
      "ating": 2117,
      "Ġpermis": 2118,
      "Ġgover": 2119,
      "Ġexpress": 2120,
      "Embed": 2121,
      "ĠUnless": 2122,
      "Ġlaw": 2123,
      "ĠTimestamp": 2124,
      "Ġsoftware": 2125,
      "pd": 2126,
      "ĠWITH": 2127,
      "ĠWARRAN": 2128,
      "license": 2129,
      "ĠBAS": 2130,
      "TIES": 2131,
      "Ġimplied": 2132,
      "Ġcompliance": 2133,
      "ĠApache": 2134,
      "Ġpermissions": 2135,
      "Ġlimitations": 2136,
      "ined": 2137,
      "Ġagreed": 2138,
      "ĠWARRANTIES": 2139,
      "Kwargs": 2140,
      "LICENSE": 2141,
      "ĠCONDI": 2142,
      "aT": 2143,
      "Ġpl": 2144,
      "fail": 2145,
      "groupby": 2146,
      "ĠKIND": 2147,
      "ĠWITHOUT": 2148,
      "erge": 2149,
      "ĠLicensed": 2150,
      "Ġgoverning": 2151,
      "licenses": 2152,
      "ĠCheck": 2153,
      "unittest": 2154,
      "ĠBASIS": 2155,
      "ĠCONDITIONS": 2156,
      "Union": 2157,
      "(*": 2158,
      "dt": 2159,
      "hub": 2160,
      "ice": 2161,
      "Ġwork": 2162,
      "][": 2163,
      "gmentation": 2164,
      "vis": 2165,
      "allclose": 2166,
      "}\")": 2167,
      "make": 2168,
      "Ġtop": 2169,
      "Ġprovided": 2170,
      "expand": 2171,
      "34": 2172,
      "table": 2173,
      "yle": 2174,
      "empty": 2175,
      "eger": 2176,
      "depth": 2177,
      "Ġspecial": 2178,
      "mt": 2179,
      "Ġcal": 2180,
      "Ġlib": 2181,
      "Ġfill": 2182,
      "Int": 2183,
      "ute": 2184,
      "zip": 2185,
      "Ġrun": 2186,
      "Ġmean": 2187,
      "ild": 2188,
      "slow": 2189,
      "probs": 2190,
      "Ġrel": 2191,
      "ipt": 2192,
      "hf": 2193,
      "ighb": 2194,
      "lex": 2195,
      "Ġsp": 2196,
      "ones": 2197,
      "imedelta": 2198,
      "peat": 2199,
      "apply": 2200,
      "transformer": 2201,
      "context": 2202,
      "masked": 2203,
      "pute": 2204,
      "75": 2205,
      "ãģ": 2206,
      "column": 2207,
      "decode": 2208,
      "Ġextra": 2209,
      "Ġreturned": 2210,
      "Ġboxes": 2211,
      "amba": 2212,
      "ctional": 2213,
      "Generation": 2214,
      "sort": 2215,
      "Ġintermediate": 2216,
      "Ġnd": 2217,
      "Ġsingle": 2218,
      "eature": 2219,
      "ced": 2220,
      "ressor": 2221,
      "save": 2222,
      "Ġent": 2223,
      "Ġproj": 2224,
      "unsqueeze": 2225,
      "ME": 2226,
      "top": 2227,
      "Ġlogger": 2228,
      "verage": 2229,
      "84": 2230,
      "logger": 2231,
      "fter": 2232,
      "](": 2233,
      "ĠInitial": 2234,
      "</": 2235,
      "Net": 2236,
      "uous": 2237,
      "ception": 2238,
      "mb": 2239,
      "ratio": 2240,
      "ens": 2241,
      "hannel": 2242,
      "Ġtyp": 2243,
      "Ġhasattr": 2244,
      "ref": 2245,
      "Ġgra": 2246,
      "Ġcls": 2247,
      "ĠMultiIndex": 2248,
      "Ġalso": 2249,
      "reshold": 2250,
      "Ġattentions": 2251,
      "celer": 2252,
      "ĠĠĠĠĠĠ": 2253,
      "ĠAl": 2254,
      "ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨ðŁļ¨": 2255,
      "request": 2256,
      "Ġspecified": 2257,
      "dense": 2258,
      "=(": 2259,
      "pop": 2260,
      "tol": 2261,
      "96": 2262,
      "ian": 2263,
      "LayerNorm": 2264,
      "Ġhelp": 2265,
      "Ġallow": 2266,
      "ĠIt": 2267,
      "Ġitem": 2268,
      "mlp": 2269,
      "ities": 2270,
      "local": 2271,
      "dis": 2272,
      "Ġcod": 2273,
      "':": 2274,
      "rot": 2275,
      "CH": 2276,
      "play": 2277,
      "Ġsamples": 2278,
      "classification": 2279,
      "Ġembedding": 2280,
      "='": 2281,
      "Ġattribut": 2282,
      "red": 2283,
      "uster": 2284,
      "ound": 2285,
      "almost": 2286,
      "has": 2287,
      "oo": 2288,
      "ideo": 2289,
      "rout": 2290,
      "Ġfinal": 2291,
      "bert": 2292,
      "variance": 2293,
      "Ġndarray": 2294,
      "cessed": 2295,
      "resolution": 2296,
      "42": 2297,
      "iloc": 2298,
      "Ġencoded": 2299,
      "Ġcos": 2300,
      "implementation": 2301,
      "Ġafter": 2302,
      "Ġiter": 2303,
      "update": 2304,
      "ld": 2305,
      "Dimension": 2306,
      "stant": 2307,
      "55": 2308,
      "arge": 2309,
      "36": 2310,
      "ighbors": 2311,
      "queries": 2312,
      "former": 2313,
      "Ġmod": 2314,
      "_,": 2315,
      "hannelDimension": 2316,
      "transformers": 2317,
      "PT": 2318,
      "ins": 2319,
      "present": 2320,
      "Ġmasks": 2321,
      "Ġgiven": 2322,
      "Ġxp": 2323,
      "ForCausalLM": 2324,
      "ances": 2325,
      "fore": 2326,
      "move": 2327,
      "ackend": 2328,
      "ĠDe": 2329,
      "ynam": 2330,
      "Ġline": 2331,
      "Ġdropout": 2332,
      "lease": 2333,
      "Ġsupported": 2334,
      "Ġinstead": 2335,
      "ignore": 2336,
      "Ġresults": 2337,
      "Ġ16": 2338,
      "core": 2339,
      "mapping": 2340,
      "videos": 2341,
      "Ġ[-": 2342,
      "ake": 2343,
      "22": 2344,
      ")`,": 2345,
      "rap": 2346,
      "CA": 2347,
      "tests": 2348,
      "Ġprompt": 2349,
      "TED": 2350,
      ":]": 2351,
      "âĸ": 2352,
      "Ġbetw": 2353,
      "Ġbetween": 2354,
      "98": 2355,
      "Ġsplit": 2356,
      "ature": 2357,
      "verse": 2358,
      "missing": 2359,
      "Ġcompute": 2360,
      "gradient": 2361,
      "sq": 2362,
      "Ġoffset": 2363,
      "Ġ--": 2364,
      "Ġ15": 2365,
      "emma": 2366,
      "Ġdt": 2367,
      "egr": 2368,
      "Ġquant": 2369,
      "support": 2370,
      "cu": 2371,
      "tension": 2372,
      "06": 2373,
      "fast": 2374,
      "Ġnext": 2375,
      "global": 2376,
      "Ġvari": 2377,
      "causal": 2378,
      "Ġconv": 2379,
      "rector": 2380,
      "coef": 2381,
      "ĠĠĠĠĠĠĠĠĠ": 2382,
      "quires": 2383,
      "propert": 2384,
      "Ġscore": 2385,
      "Feature": 2386,
      "case": 2387,
      "atter": 2388,
      "full": 2389,
      "ient": 2390,
      "Ġthen": 2391,
      "math": 2392,
      "\"`": 2393,
      "78": 2394,
      "tes": 2395,
      "configuration": 2396,
      "atten": 2397,
      "Ġparameters": 2398,
      "2000": 2399,
      "aN": 2400,
      "Ġscale": 2401,
      "edge": 2402,
      "imal": 2403,
      "Ġcorrect": 2404,
      "ctionary": 2405,
      "hap": 2406,
      "lowing": 2407,
      "be": 2408,
      "Bert": 2409,
      "Ġkeep": 2410,
      "validation": 2411,
      "ormer": 2412,
      "ĠQwen": 2413,
      "Ġexample": 2414,
      "ĠCategorical": 2415,
      "mult": 2416,
      "Ġcorrespon": 2417,
      "urce": 2418,
      "Conditional": 2419,
      "ability": 2420,
      "ynamic": 2421,
      ".\",": 2422,
      "sklearn": 2423,
      "ba": 2424,
      "eed": 2425,
      "pair": 2426,
      "Ġarguments": 2427,
      "ĠSt": 2428,
      "steps": 2429,
      "Ġcheckpoint": 2430,
      "indexer": 2431,
      "seed": 2432,
      "encode": 2433,
      "Ġtwo": 2434,
      "iding": 2435,
      "Ġoper": 2436,
      "ĠAny": 2437,
      "reason": 2438,
      "Ġreserved": 2439,
      "ĠPeriod": 2440,
      "]])": 2441,
      "Ġcons": 2442,
      "uffer": 2443,
      "uture": 2444,
      "Ġ&": 2445,
      "Ġsee": 2446,
      "Ġval": 2447,
      "groups": 2448,
      "see": 2449,
      "LIP": 2450,
      "rectory": 2451,
      "memory": 2452,
      "open": 2453,
      "Ġraw": 2454,
      "contain": 2455,
      "lav": 2456,
      "Ġelement": 2457,
      "Ġengine": 2458,
      "experts": 2459,
      "rank": 2460,
      "Ġcontext": 2461,
      "ia": 2462,
      "WithP": 2463,
      "PEC": 2464,
      "Ġ:]": 2465,
      "Ġenum": 2466,
      "ĠRo": 2467,
      "extractor": 2468,
      "pool": 2469,
      "################": 2470,
      "olver": 2471,
      "cur": 2472,
      "Ġ...,": 2473,
      "functional": 2474,
      "Ġtmp": 2475,
      "Ġtests": 2476,
